Extensions installed on Dev Container: Azure Search OpenAI Demo - C# @ desktop-linux:
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github

ms-azure-devops.azure-pipelines

ms-azuretools.azure-dev
ms-azuretools.vscode-apimanagement
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurecontainerapps
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestaticwebapps
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-azurevirtualmachines
ms-azuretools.vscode-bicep
ms-azuretools.vscode-cosmosdb
ms-azuretools.vscode-docker
ms-azuretools.vscode-logicapps

ms-dotnettools.blazorwasm-companion
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.dotnet-interactive-vscode
ms-dotnettools.dotnet-maui
ms-dotnettools.vscode-dotnet-pack
ms-dotnettools.vscode-dotnet-runtime
ms-dotnettools.vscode-dotnet-sdk

ms-kubernetes-tools.aks-devx-tools
ms-kubernetes-tools.vscode-aks-tools
ms-kubernetes-tools.vscode-kubernetes-tools

ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-ai
ms-toolsai.vscode-ai-remote
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

ms-vscode.azure-account
ms-vscode.azurecli
ms-vscode.vscode-github-issue-notebooks
ms-vscode.vscode-node-azure-pack

msazurermtools.azurerm-vscode-tools

redhat.vscode-yaml